Ponyboy3/STC15F2K60S2-reference-guide/练习代码/05题集(2024)/11 24c02/main.c
//	if (S4 == 0) {
//		Delay_Keys(100);
//		if (S4 == 0) {
//			// =========================================== 代码开始 ======================================

//			// =========================================== 代码结束 ======================================
//			while(S4 == 0);
//			// =========================================== 代码开始 ======================================

//			// =========================================== 代码结束 ======================================
//		}
//	}
//}

// ================= 代码结束 =============

//============================================矩阵按键============================================
sfr P4 = 0xc0;
sbit P44 = P4^4;
sbit P42 = P4^2;

uchar Scan_Keys()
{
	char H,L;
	P3 =  0xcf;P44 = 0;P42 = 0;H = (~P3) & 0x0f;
	if(H == 0) return 0;
	Delay_Keys(100);
	P3 =  0xcf;P44 = 0;P42 = 0;H = (~P3) & 0x0f;
	if(H == 0) return 0;
	P3 =  0xf0;P44 = 1;P42 = 1;L = (~P3) & 0x30;
	if(P44 == 0) L |= 0x80;
	if(P42 == 0) L |= 0x40;
	return (H+L);
}

void Change_Keys()
{
	switch(Scan_Keys())
	{
		case 0x88:GN = 4;break;  // S4
		case 0x84:GN = 5;break;  // S5
		case 0x82:GN = 6;break;  // S6
		case 0x81:GN = 7;break;  // S7
		case 0x48:GN = 8;break;  // S8
		case 0x44:GN = 9;break;  // S9
		case 0x42:GN = 10;break;  // S10
		case 0x41:GN = 11;break;  // S11
		case 0x28:GN = 12;break;  // S12
		case 0x24:GN = 13;break;  // S13
		case 0x22:GN = 14;break;  // S14
		case 0x21:GN = 15;break;  // S15
		case 0x18:GN = 16;break;  // S16
		case 0x14:GN = 17;break;  // S17
		case 0x12:GN = 18;break;  // S18
		case 0x11:GN = 19;break;  // S19
		case 0:GN = 0;break;
	}
}
//============================================24C02初始化============================================
void Write_24C02_Byte(unsigned char addr,unsigned char dat)
{
	IIC_Start();
	IIC_SendByte(0xa0);
	IIC_WaitAck();
	IIC_SendByte(addr);
	IIC_WaitAck();
	IIC_SendByte(dat);
	IIC_WaitAck();
	IIC_Stop(); 
}

unsigned char Read_24C02_Byte(unsigned char addr)
{
	unsigned char tmp;
	IIC_Start();
	IIC_SendByte(0xa0);
	IIC_WaitAck();
	IIC_SendByte(addr);
	IIC_WaitAck();
	
	IIC_Start();
	IIC_SendByte(0xa1);
	IIC_WaitAck();
	tmp = IIC_RecByte(); 
	IIC_SendAck(1);
	IIC_Stop();
	
	return tmp;
}

void Write_24C02_Page(unsigned char addr, unsigned char *dat, unsigned char len)
{
	unsigned char i;
	IIC_Start();
	IIC_SendByte(0xa0);
	IIC_WaitAck();
	IIC_SendByte(addr);
	IIC_WaitAck();
	
	for (i = 0; i < len; i ++ ) {
		IIC_SendByte(dat[i]);
		IIC_WaitAck();
	}
	IIC_Stop(); 
}

void Read_24C02_Page(unsigned char addr, unsigned char *dat, unsigned char len)
{
	unsigned char i;
	IIC_Start();
	IIC_SendByte(0xa0);
	IIC_WaitAck();
	IIC_SendByte(addr);
	IIC_WaitAck();
	
	IIC_Start();
	IIC_SendByte(0xa1);
	IIC_WaitAck();
	for (i = 0; i < len - 1; i ++ ) {
		dat[i] = IIC_RecByte();
		IIC_SendAck(0);
	}
	dat[len - 1] = IIC_RecByte();
	IIC_SendAck(1);
	IIC_Stop();
}
//============================================DS18B20初始化============================================
void Init_18b20()
{
	init_ds18b20();
	Write_DS18B20(0xcc);
	Write_DS18B20(0x4e);
	Write_DS18B20(0x00);
	Write_DS18B20(0x00);
	Write_DS18B20(0x7f);
}
unsigned int Read_Temperature(void)  // 当需要保留2为小数时，才需要用到unsigned int,
									 // 这里介绍3种类型，所以用unsigned int，保留整数
							         // 和一位小数可用unsigned char.
{
	unsigned char H,L;
	init_ds18b20();
	Write_DS18B20(0xcc);
	Write_DS18B20(0xbe);
	L = Read_DS18B20();
	H = Read_DS18B20();
	
	init_ds18b20();
	Write_DS18B20(0xcc);
	Write_DS18B20(0x44);
	
	//1.保留整数--23
	//temp = (H<<4) + (L>>4);
	
	//2.保留1位小数--23.4
	//temp = ((H<<8) + L)*5/8;
	
	//3.保留2位小数--23.45
	return ((H<<8)+L)*25/4;  // (50/8)
}
//============================================Ds1302初始化============================================
void My_Write_Ds1302()
{
	Write_Ds1302_Byte(0x8e,0x00);
	Write_Ds1302_Byte(0x84,dat1);//时
	Write_Ds1302_Byte(0x82,dat2);//分
	Write_Ds1302_Byte(0x80,dat3);//秒
}
void My_Read_Ds1302()
{
	ds1302_h = Read_Ds1302_Byte(0x85);//时
	ds1302_h = (ds1302_h >> 4) * 10 + (ds1302_h & 0x0f);
	ds1302_m = Read_Ds1302_Byte(0x83);//分
	ds1302_m = (ds1302_m >> 4) * 10 + (ds1302_m & 0x0f);
	ds1302_s = Read_Ds1302_Byte(0x81);//秒
	ds1302_s = (ds1302_s >> 4) * 10 + (ds1302_s & 0x0f);
}
//============================================定时器T0初始化=======================================
uchar count = 0;
uchar pwm_dut = 0;//占空比
void Init_T0()
{
	TMOD = (TMOD & 0xf0) | 0x01;  // 定时
	TH0 = (65536 - 2000) / 256;
	TL0 = (65536 - 2000) % 256;
	
	EA = 1;
	ET0 = 1;
	TR0 = 1;
}
//============================================定时器T1初始化=======================================
void Init_T1()
{
	TMOD = (TMOD & 0x0f) | 0x10;//定时
	TH1 = (65536 - 12) / 256;
	TL1 = (65536 - 12) % 256;
	
//	EA = 1;
//	ET1 = 1;
//	TR1 = 1;
}
//============================================超声波测距=======================================
sbit TX = P1 ^ 0;
sbit RX = P1 ^ 1;

//======发射超声波信号====
void send_Wave()
{
	unsigned char i = 8;
	// 12MHZ的12分频，间隔定时12us;
	TR1 = 0;
	TH1 = 0xff;
	TL1 = 0xf4;
	TF1 = 0;
	TR1 = 1;
	// 发射8个40khz的超声波信号
	while (i -- ) {
		TX = 0;
		while (!TF1);
		TF1 = 0;
		TX = 1;
		while (!TF1);
		TF1 = 0;
	}
	
//	uchar temp = 16;
//	TX = 0;
//	TR1 = 1;
//	// 引脚发送40Khz方波信号
//	while (temp--) // 每隔12us发8个方波
//	{
//		while (!TF1)
//			;
//		TX ^= 1; // if(TX==1) { Delay20us();}//可以不用
//		TH1 = (65536 - 12) / 256;
//		TL1 = (65536 - 12) % 256;
//		TF1 = 0;
//	}
}

void Get_Distance() {
	// 先发射8个40khz的超声波信号
	send_Wave();
	
	TR1 = 0;
	TL1 = 0x00;
	TH1 = 0xe0;
	TF1 = 0;
	TR1 = 1;
	while (RX && !TF1);
	TR1 = 0;
	
	if (TF1 == 1)
	{
		TF1 = 0;
		distance = 999;
	}
	// 超声波速度约344m/s
	// 距离 L = （344m/s*t）/2=172m/s*t
	// t取微秒，即：L = 0.0172cm/us*t
	else
		distance = (((TH1 & 0x1f) << 8) | TL1) * 0.0172;
}

uchar Get_Distance_2()
{
	uchar temp = 16;
	TX = 0;
	TR1 = 1;
	// 引脚发送40Khz方波信号
	while (temp--) // 每隔12us发8个方波
	{
		while (!TF1)
			;
		TX ^= 1; // if(TX==1) { Delay20us();}//可以不用
		TH1 = (65536 - 12) / 256;
		TL1 = (65536 - 12) % 256;
		TF1 = 0;
	}
	//	while(temp--)
	//	{
	//		while(!TF0);
	//		TX ^= 1;//TX = ~TX;
	//		TH0=(65536-12)/256;
	//		TL0=(65536-12)%256;
	//		TF0 = 0;//TF0必须要先赋值(益处中断，自动置1)在清零
	//	}
	TR1 = 0;
	TL1 = 0;
	TH1 = 0;
	TR1 = 1;
	while (RX && !TF1)
		;
	TR1 = 0;

	if (TF1 == 1)
	{
		TF1 = 0;
		return 999;
	}
	else
		return ((TH1 << 8) + TL1) * 0.017;
}
//============================================串口初始化============================================
#include "intrins.h"
#include "string.h"

sfr AUXR = 0x8e;  // 辅助寄存器
sfr T2H=0xd6;  // 定时器2高8位
sfr T2L=0xd7;  // 定时器2低8位
#define BAUD         9600
//#define SYSTEMCLOCK  11059200L
#define SYSTEMCLOCK  12000000L
uchar command = 0x00;
void Init_Uart()
{
	// ===================T1实现===================
//	TMOD = (TMOD & 0x0f) | 0x00;
//	
//	TL1 = (65535-(SYSTEMCLOCK / 4 / BAUD));
//	TH1 = (65535-(SYSTEMCLOCK / 4 / BAUD)) >> 8l;
//	
////	ET1 = 0;		    //禁止定时器1中断
//	TR1 = 1;		    //启动定时器1
//	
//	SCON = 0x50;
//	AUXR = 0x40;
	// ===================T1实现===================
	
