Ponyboy3/STC15F2K60S2-reference-guide/练习代码/05题集(2024)/11 24c02/main.c
	// ===================T2实现===================
	SCON = 0x50;  // 8位数据,可变波特率
    AUXR |= 0x01; // 串口1选择定时器2为波特率发生器
    AUXR |= 0x04; // 定时器时钟1T模式
	
	T2L = (65535-(SYSTEMCLOCK / 4 / BAUD));
	T2H = (65535-(SYSTEMCLOCK / 4 / BAUD)) >> 8l;
	
//	ET1 = 0;		    //禁止定时器1中断
//	TR1 = 1;		    //启动定时器1
//	SCON = 0x50;
//	AUXR = 0x40;
	
	AUXR |= 0x10; // 定时器2开始计时
	// ===================T2实现===================
	
	ES = 1;
	EA = 1;
	
//	SCON = 0x50;		//8位数据,可变波特率
//	AUXR &= 0xBF;		//定时器1时钟为Fosc/12,即12T
//	AUXR &= 0xFE;		//串口1选择定时器1为波特率发生器
//	TMOD &= 0x0F;		//设定定时器1为16位自动重装方式
//	TL1 = 0xE8;		//设定定时初值
//	TH1 = 0xFF;		//设定定时初值
//	ET1 = 0;		//禁止定时器1中断

//	ES = 1;
//	EA = 1;  
//	TR1 = 1;		//启动定时器1
}
// 发送一个字节数据
void Send_Byte(unsigned char dat)
{
	SBUF = dat;
	while(TI == 0);
	TI = 0;
}
//发送一串字符串
void Send_String(unsigned char* str)
{
  
  while(*str != '\0')
  {
    Send_Byte(*(str++));
  }
}
//==========================================系统初始化=============================================
void Init_Sys()
{
	P2 = (P2 & 0x1f) | 0x80;  // LED
	P0 = 0xff;
	P2 &= 0x1f;
	P2 = (P2 & 0x1f) | 0xa0;  // 蜂鸣器，寄存器
	P0 = 0x00;
	P2 &= 0x1f;
	P2 = (P2 & 0x1f) | 0xc0;  // 数码管
	P0 = 0xff;
	P2 &= 0x1f;
	P2 = (P2 & 0x1f) | 0xe0;
	P0 = 0xff;
	
	num1=num2=num3=num4=num5=num6=num7=num8=10;
}

void LED_control() {
	// ================= 测试开始 =============
//	P2 = (P2 & 0x1f) | 0x80;  // LED控制开启
//	P0 = 0x7f;  // 要将P0放在这两句代码之间，避免错乱
//	P2 &= 0x1f;
	// ================= 测试结束 =============
	
	// =========================================== 代码开始 ======================================
	
	// =========================================== 代码结束 ======================================
}

void main()
{
	Init_Sys();
	
	num_On_Off = Read_24C02_Byte(0x00);
	
	Init_T1();
//	TMOD = (TMOD & 0x0f) | 0x00;//定时
	Init_T0();
	Init_18b20();
//	My_Write_Ds1302();

//	num_On_Off = Read_24C02_Byte(0x00);
//	num_On_Off ++ ;
//	Write_24C02_Byte(0x00, num_On_Off);

	Read_24C02_Page(0x01, dat, 3);
	
	
//	dat2 = (dat[2] / 10) << 4 | (dat[2] % 10);
	dat1 = dat[0] /10*16 + dat[0] % 10;
	dat2 = dat[1] /10*16 + dat[1] % 10;
	dat3 = dat[2] /10*16 + dat[2] % 10;
	
	My_Write_Ds1302();
	
	Init_Uart();
//	Send_Byte(dat[2] /10*16 + dat[2] % 10);
//	Send_Byte(0xA0);
	Send_String("I am OK\r\n");
	
	while(1)
	{
//		LED_control();
        if(f_2ms == 1)
        {
            f_2ms = 0;			
			LED_control();  // xxx
//			Write_24C02_Byte(0x02,ds1302_s);	

			distance = Get_Distance_2();  // 超声波测距		
			// =======================按键开始========================
			/*根据需要选择对应的按键类型*/
//			Change_Keys_Alone();  // 1.独立按键扫描(1)
//			ScanKeys_Alone();     // 2.独立按键扫描(2)
			Change_Keys();        // 3.矩阵按键扫描
			if (GN == 16) {  // S16
				// =========================================== 代码开始 ======================================
				LED1_On();
				// =========================================== 代码结束 ======================================
				while(Scan_Keys());
				// =========================================== 代码开始 ======================================
				LED1_Off();
				dis_model ++ ;
				if (dis_model > 4) dis_model = 0;
				// =========================================== 代码结束 ======================================
			}
			
			if (GN == 12) {  // S12
				// =========================================== 代码开始 ======================================
				LED2_On();
				// =========================================== 代码结束 ======================================
				while(Scan_Keys());
				// =========================================== 代码开始 ======================================
				LED2_Off();
				f_time = ~f_time;
				// =========================================== 代码结束 ======================================
			}
			
			if (GN == 8) {  // S8
				// =========================================== 代码开始 ======================================
				LED5_On();
				// =========================================== 代码结束 ======================================
				while(Scan_Keys());
				// =========================================== 代码开始 ======================================
				LED5_Off();
				
				// 时间加
				if (set_ds1302_key_modele == 1) {  // 小时设置
					set_ds1302_h ++ ;
					if (set_ds1302_h > 23) set_ds1302_h = 0;
				}
				else if (set_ds1302_key_modele == 2) {  // 分钟设置
					set_ds1302_m ++ ;
					if (set_ds1302_m > 59) set_ds1302_m = 0;
				}
				else if (set_ds1302_key_modele == 3) {  // 秒设置
					set_ds1302_s ++ ;
					if (set_ds1302_s > 59) set_ds1302_s = 0;
				}
				
				// =========================================== 代码结束 ======================================
			}
			
			if (GN == 9) {  // S9
				// =========================================== 代码开始 ======================================
				LED5_On();
				// =========================================== 代码结束 ======================================
				while(Scan_Keys());
				// =========================================== 代码开始 ======================================
				LED5_Off();
				
				// 时间减
				if (set_ds1302_key_modele == 1) {  // 小时设置
					set_ds1302_h -- ;
					if (set_ds1302_h < 0) set_ds1302_h = 23;
				}
				else if (set_ds1302_key_modele == 2) {  // 分钟设置
					set_ds1302_m -- ;
					if (set_ds1302_m < 0) set_ds1302_m = 59;
				}
				else if (set_ds1302_key_modele == 3) {  // 秒设置
					set_ds1302_s -- ;
					if (set_ds1302_s < 0) set_ds1302_s = 59;
				}
				// =========================================== 代码结束 ======================================
			}

			if (GN == 4) {  // S4
				// =========================================== 代码开始 ======================================
				LED3_On();
				is_key_set_time = 1;  // 按键按下未松开
				
				
				// =========================================== 代码结束 ======================================
				while(Scan_Keys());
				// =========================================== 代码开始 ======================================
				LED3_Off();
				LED4_Off();
				is_key_set_time = 0;  // 按键按下松开
				num_s_key = 0;
				
				if (f_key_long) {  // 长按转换模式
					set_ds1302_key_modele ++ ;
					f_key_long = 0;
				}
				
				
//				if (set_ds1302_key_modele == 1) {  // 小时设置
//					set_ds1302_h = 23;
//				}
//				else if (set_ds1302_key_modele == 2) {  // 分钟设置
//					set_ds1302_m = 29;
//				}
//				else if (set_ds1302_key_modele == 3) {  // 秒设置
//					set_ds1302_s = 45;
//				}
				if (set_ds1302_key_modele == 4) {  // 确认
					if (dis_model == 2) {
						dat[0] = set_ds1302_h;
						dat[1] = set_ds1302_m;
						dat[2] = set_ds1302_s;
						Write_24C02_Page(0x01, dat, 3);
						
						dat1 = dat[0] /10*16 + dat[0] % 10;
						dat2 = dat[1] /10*16 + dat[1] % 10;
						dat3 = dat[2] /10*16 + dat[2] % 10;

						My_Write_Ds1302();
					}
					set_ds1302_key_modele = 0;
				}
				// =========================================== 代码结束 ======================================
			}
			/*根据需要添加对应按键*/
			// =======================按键结束========================
			
			// =======================串口调试开始====================
			if(command != 0x00)
			{
				switch(command & 0xf0)
				{
					case 0xa0:
						P0 = temp_Led_P0;
						P2 = (P2 & 0x1f) | 0x80;  // LED
						P0 = (P0 | 0x0f) & ((~command) | 0xf0);
						temp_Led_P0 = P0;
						P2 &= 0x1f;
						command = 0x00;
					break;
					case 0xb0:
						P0 = temp_Led_P0;
						P2 = (P2 & 0x1f) | 0x80;  // LED
						P0 = (P0 | 0xf0) & (((~command) << 4) | 0x0f);
						temp_Led_P0 = P0;
						P2 &= 0x1f;
						command = 0x00;
					break;
					case 0xc0:
						Send_String("system is running...!\r\n");
						command = 0x00;
					break;
				}
			}
			// =======================串口调试结束====================		
			
			// =========================================== 代码开始 ======================================			
			// =======================1.温度读取开始========================
			if (f_200ms_temperature) {
				f_200ms_temperature = 0;
				temperature = Read_Temperature();
				My_Read_Ds1302();
			}
//			num1=10;num2=10;num3=10;num4=10;
//			num5=temperature/1000;num6=temperature/100%10;
//			num7=temperature/10%10;num8=temperature%10;
			// =======================1.温度读取结束========================
			
