Ponyboy3/STC15F2K60S2-reference-guide/练习代码/05题集(2024)/11 24c02/main.c
			dat[0] = ds1302_h;
			dat[1] = ds1302_m;
			dat[2] = ds1302_s;
			Write_24C02_Page(0x01, dat, 3);
			
			if (dis_model == 0) {  // 时间显示
				num1=ds1302_h/10;num2=ds1302_h%10;num3=11;
				num4=ds1302_m/10;num5=ds1302_m%10;num6=11;
				num7=ds1302_s/10;num8=ds1302_s%10;
			}
			else if (dis_model == 1) {  // 温度显示
				num1=dis_model;num2=10;num3=10;num4=10;
				num5=temperature/1000;num6=temperature/100%10;
				num7=temperature/10%10;num8=temperature%10;
			}
			else if (dis_model == 2) {  // 时间设置
//				num_On_Off = Read_24C02_Byte(0x00);
//				num_On_Off ++ ;
//				Write_24C02_Byte(0x00, num_On_Off);
				f_set_time = 1;  // 时间设置标志
				num1 = set_ds1302_h / 10; num2 = set_ds1302_h % 10; num3 = 11; 
				num4 = set_ds1302_m / 10; num5 = set_ds1302_m % 10; num6 = 11;
				num7 = set_ds1302_s / 10, num8 = set_ds1302_s % 10;

			}
			else if (dis_model == 3) {
				num1 = dis_model;num2 = 10; num3 = 10; num4 = 10;
				num5= 10;
				num6=distance / 100; num7=distance % 100 / 10; num8=distance % 10;
			}
			else if (dis_model ==4) {
				num1=dis_model;num2=dat[0]%10;num3=11;
				num4=dat[1]/10;num5=dat[1]%10;num6=11;
				num7=dat[2]/10;num8=dat[2]%10;
			}
			// =========================================== 代码结束 ======================================
        }
    }
}

void Service_T0() interrupt 1
{
	TH0 = (65536 - 2000) / 256;
	TL0 = (65536 - 2000) % 256;
	
	f_2ms = 1;
	
	/***************************************************
	与时间相关的变量的更新放在里面
	注意：不要把消耗过长时间的代码（如for循环等）放在这里，容易造成错乱
	***************************************************/
	// =========================================== 代码开始 ======================================
	num_2ms ++ ;
	num_2ms_temperature ++ ;
	if (num_2ms_temperature == 100) {
		f_200ms_temperature = 1;
		num_2ms_temperature = 0;
	}
	
	if (num_2ms == 500) {
		f_1s = 1;
		num_2ms = 0;
	}
	
	if (f_1s == 1) {
		f_1s = 0;
		
		if (f_time) num_s ++ ;
		
		if (is_key_set_time && dis_model == 2) {
			num_s_key ++ ;
//			t_key = 0;
			if (num_s_key == 3) {
				LED4_On();
				f_key_long = 1;
			}
		}			
			
		
		if (num_s == 9) 
			num_s = 0;
	}
	// =========================================== 代码结束 ======================================
	
	Display_SMG(num1,num2,num3,num4,num5,num6,num7,num8);//2ms刷新数码管
}

void ServiceUart() interrupt 4
{
	if(RI == 1)
	{
		RI = 0;//人工清零
		urdat = SBUF;
		command = SBUF;
//		Send_Byte(urdat + 1);
//		send_byte(0x5a);
//		send_byte(0xa5);
	}
}